package result

//
func Jsons(code int32) Myjson {
	return codeMap[code]
}

//格式化返回数据
type Myjson struct {
	Code   int32       `json:"code"`
	Msg    string      `json:"msg"`
	Result interface{} `json:"result"`
}

//状态码与提示信息
var codeMap = map[int32]Myjson{
	//成功
	10000: {10000, "success", nil},
	//系统异常
	10001: {10001, "网络繁忙", nil},
	10002: {10002, "网络繁忙", nil},
	10003: {10003, "该接口暂停服务", nil},
	32001: {32001, "网络繁忙", nil},
	32003: {32003, "网络繁忙", nil},
	33001: {33001, "网络繁忙", nil},
	33003: {33003, "网络繁忙", nil},
	33006: {33006, "网络繁忙", nil},

	//客户端参数错误
	20001: {20001, "用户名或密码为空", nil},
	20002: {20002, "用户名格式错误", nil},
	20003: {20003, "", nil},
	20004: {20004, "密码格式错误", nil},
	20005: {20005, "", nil},
	20006: {20006, "该用户信用太低", nil},
	20007: {20007, "该用户状态异常", nil},
	20008: {20008, "该用户已被注册", nil},
	20009: {20009, "该用户不存在", nil},
	20010: {20010, "短信次数达到上限", nil},
	20011: {20011, "", nil},
	20012: {20012, "验证码格式错误", nil},
	20013: {20013, "", nil},
	20014: {20014, "", nil},
	20015: {20015, "昵称不能为空", nil},
	20016: {20016, "昵称格式错误", nil},
	20017: {20017, "姓名不能为空", nil},
	20018: {20018, "姓名格式有误", nil},
	20019: {20019, "身份证号码为空或有误", nil},
	20020: {20020, "", nil},
	20021: {20021, "姓名与IDCard不符", nil},
	20022: {20022, "该账户已实名", nil},
	20023: {20023, "云端暂无数据", nil},
	20024: {20024, "", nil},
	20025: {20025, "", nil},
	20026: {20026, "不允许该操作", nil},
	20027: {20027, "请登陆后再操作", nil},
	20028: {20028, "邀请码错误", nil},
	20029: {20029, "邀请码被绑定", nil},
	20030: {20030, "该用户无操作权限", nil},

	21001: {21001, "参数不能为空", nil},
	21002: {21002, "参数格式不合法", nil},
	21003: {21003, "记录被封禁", nil},
	21004: {21004, "用户被警告", nil},
	21005: {21005, "无权限操作", nil},
	21006: {21006, "文件不能为空", nil},
	21007: {21007, "文件ID错误", nil},
	21008: {21008, "无资源", nil},

	23019: {23019, "token为空", nil},
	32002: {32002, "用户名或密码错误", nil},
	33002: {33002, "未查到该用户信息", nil},
	33004: {33004, "验证码为空或有误", nil},
	33005: {33005, "无该token", nil},
	33007: {33007, "账号未激活", nil},
	33008: {33008, "该用户名已存在", nil},
	33009: {33009, "密码错误", nil},
	33010: {33010, "source为空或有误", nil},
	33011: {33011, "参数错误", nil},
	33012: {21005, "无权限操作", nil},
	33013: {33013, "相关暂无", nil},
	33015: {33015, "发送短信次数超过限制", nil},
	33016: {33016, "IP调用次数异常", nil},
}